Revit 2027 API
BindingMap.Erase Method
This method is used to erase one item in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int Erase(
	Definition key
)
Public Overrides Function Erase (
	key As Definition
) As Integer
public:
virtual int Erase(
	Definition^ key
) override
abstract Erase :
        key : Definition -> int
override Erase :
        key : Definition -> int
Parameters
key Definition
Return Value
Int32
Remarks
The method Erase inherited from base class is not permitted for this class. A Autodesk::Revit::Exceptions::InvalidOperationException will be thrown. Use Remove() instead to remove the binding from the Revit session and from the map.
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace